results/fio/adft/run3.log
write_throughput: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=64
...
fio-3.39-38-gf18c
Starting 16 processes
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
[...]

write_throughput: (groupid=0, jobs=16): err= 0: pid=2839865: Sun Apr 27 22:19:10 2025
  write: IOPS=506, BW=507MiB/s (531MB/s)(14.9GiB/30031msec); 0 zone resets
    clat (usec): min=2234, max=75600, avg=31507.29, stdev=2610.39
     lat (usec): min=2283, max=75647, avg=31550.81, stdev=2610.32
    clat percentiles (usec):
     |  1.00th=[23987],  5.00th=[31065], 10.00th=[31065], 20.00th=[31065],
     | 30.00th=[31065], 40.00th=[31065], 50.00th=[31327], 60.00th=[31327],
     | 70.00th=[31589], 80.00th=[31851], 90.00th=[32375], 95.00th=[32637],
     | 99.00th=[39060], 99.50th=[49021], 99.90th=[62129], 99.95th=[63701],
     | 99.99th=[68682]
   bw (  KiB/s): min=462496, max=559104, per=100.00%, avg=519458.08, stdev=1119.39, samples=952
   iops        : min=  446, max=  546, avg=505.16, stdev= 1.11, samples=952
  lat (msec)   : 4=0.03%, 10=0.09%, 20=0.42%, 50=98.99%, 100=0.47%
  cpu          : usr=0.20%, sys=0.42%, ctx=15360, majf=0, minf=580
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15218,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=507MiB/s (531MB/s), 507MiB/s-507MiB/s (531MB/s-531MB/s), io=14.9GiB (16.0GB), run=30031-30031msec

Disk stats (read/write):
  sdc: ios=0/16382, sectors=0/33295200, merge=0/120, ticks=0/512445, in_queue=512706, util=90.89%